#ifndef _AD_KEY_H
#define _AD_KEY_H

/******************************1、头文件****************************************/
#include "pin_remap.h"
#include "stm32f10x.h"
#include "integer.h"
#include "string.h"



/*******************************2、宏定义***************************************/
#define AD_KEY_TELORATE_VALUE 50



/*******************************3、类型定义**************************************/
typedef enum 
{
	KEY_AD_GND =   0,    //0v    
	KEY_AD1_1=  496,	  //0.3v--ADC496 
	KEY_AD1_2 = 999,	  //0.6v--ADC999
	KEY_AD1_3 = 1473,	  //0.9v--ADC1473
	KEY_AD1_4 = 1952,	  //1.2v--ADC1952
	KEY_AD1_5 = 2422,	  //1.5v--ADC2422
	KEY_AD1_6 = 2973,	  //1.8v--ADC2973
	KEY_AD1_7 = 3416,	  //2.1v--ADC3416
	KEY_AD1_8 = 3921,	  //2.4v--ADC3921
	KEY_AD2_1=  495,	  //-----0.3v--ADC496      
	KEY_AD2_2 = 998,	  //-----0.6v--ADC999
	KEY_AD2_3 = 1472,	  //-----0.9v--ADC1473
	KEY_AD2_4 = 1951,	  //-----1.2v--ADC1952
	KEY_AD2_5 = 2421,	  //-----1.5v--ADC2422
	KEY_AD2_6 = 2972,	  //-----1.8v--ADC2973
	KEY_AD2_7 = 3415,	  //-----2.1v--ADC3416
	KEY_AD2_8 = 3920,	  //-----2.4v--ADC3921
}ADKey_Typedef;



/*******************************4、声明变量**************************************/
extern u32 ADC_AveraValue[2];


/*******************************5、声明函数***************************************/
void KeyInit(void);                       
ADKey_Typedef GetKeyValue(void);     


#endif




