#ifndef SPI_LCD_H
#define SPI_LCD_H

/*********************************头文件*************************************/
//#include "integer.h"
#include "stm32f10x.h"
#include "pin_remap.h"
#include "delay.h"

/**********************************宏定义************************************/
#define DEFAULT_CONTRAS 0x15                                  // LCD对比度


/**********************************类型定义************************************/


/**********************************变量声明************************************/


/**********************************函数声明************************************/
void LcdInit(void);
void LCDDrawDot(s16 x, s16 y, u32 color);          //在显存上打一个点
void UPDATE_ScreenRAM(void);                       //将显存的数据推送到LCD显示


void SdCmd(uint8_t Command);

#endif

